{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.4", "config": {"name": "sequential_1", "layers": [{"class_name": "Cropping2D", "config": {"trainable": true, "name": "cropping2d_1", "batch_input_shape": [null, 160, 320, 3], "dtype": "float32", "data_format": "channels_last", "cropping": [[70, 25], [0, 0]]}}, {"class_name": "Lambda", "config": {"trainable": true, "name": "lambda_1", "function_type": "lambda", "function": ["4wEAAAAAAAAAAQAAAAIAAABTAAAAcwwAAAB8AABkAQAbZAIAGFMpA07nAAAAAADgb0DnAAAAAAAA\n4D+pACkB2gF4cgMAAAByAwAAAPoJTW9kZWwyLnB52gg8bGFtYmRhPjMAAABzAAAAAA==\n", null, null], "arguments": {}, "output_shape_type": "raw", "output_shape": null}}, {"class_name": "Conv2D", "config": {"use_bias": true, "bias_constraint": null, "name": "conv2d_1", "bias_regularizer": null, "activation": "linear", "activity_regularizer": null, "padding": "valid", "strides": [2, 2], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [5, 5], "kernel_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 6}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Conv2D", "config": {"use_bias": true, "bias_constraint": null, "name": "conv2d_2", "bias_regularizer": null, "activation": "linear", "activity_regularizer": null, "padding": "valid", "strides": [2, 2], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [5, 5], "kernel_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 16}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "Conv2D", "config": {"use_bias": true, "bias_constraint": null, "name": "conv2d_3", "bias_regularizer": null, "activation": "linear", "activity_regularizer": null, "padding": "valid", "strides": [2, 2], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [5, 5], "kernel_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 32}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "Conv2D", "config": {"use_bias": true, "bias_constraint": null, "name": "conv2d_4", "bias_regularizer": null, "activation": "linear", "activity_regularizer": null, "padding": "valid", "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [3, 3], "kernel_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 32}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "Conv2D", "config": {"use_bias": true, "bias_constraint": null, "name": "conv2d_5", "bias_regularizer": null, "activation": "linear", "activity_regularizer": null, "padding": "valid", "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [3, 3], "kernel_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 32}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_constraint": null, "name": "dense_1", "activation": "linear", "kernel_regularizer": null, "units": 1164, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_constraint": null, "name": "dense_2", "activation": "linear", "kernel_regularizer": null, "units": 100, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_7", "activation": "relu"}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_constraint": null, "name": "dense_3", "activation": "linear", "kernel_regularizer": null, "units": 50, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_8", "activation": "relu"}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_constraint": null, "name": "dense_4", "activation": "linear", "kernel_regularizer": null, "units": 10, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_9", "activation": "relu"}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_constraint": null, "name": "dense_5", "activation": "linear", "kernel_regularizer": null, "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activity_regularizer": null}}]}}