{"keras_version": "2.2.4", "backend": "tensorflow", "config": {"layers": [{"config": {"batch_input_shape": [null, 160, 320, 3], "cropping": [[70, 25], [0, 0]], "name": "cropping2d_1", "trainable": true, "data_format": "channels_last", "dtype": "float32"}, "class_name": "Cropping2D"}, {"config": {"function_type": "lambda", "function": ["4wEAAAAAAAAAAQAAAAIAAABTAAAAcwwAAAB8AABkAQAbZAIAGFMpA07nAAAAAADgb0DnAAAAAAAA\n4D+pACkB2gF4cgMAAAByAwAAAPoJTW9kZWwyLnB52gg8bGFtYmRhPlAAAABzAAAAAA==\n", null, null], "name": "lambda_1", "output_shape_type": "raw", "trainable": true, "output_shape": null, "arguments": {}}, "class_name": "Lambda"}, {"config": {"data_format": "channels_last", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "strides": [2, 2], "padding": "valid", "filters": 6, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_1", "trainable": true, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [5, 5], "use_bias": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"data_format": "channels_last", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "strides": [2, 2], "padding": "valid", "filters": 16, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_2", "trainable": true, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [5, 5], "use_bias": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_2"}, "class_name": "Activation"}, {"config": {"data_format": "channels_last", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "strides": [2, 2], "padding": "valid", "filters": 32, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_3", "trainable": true, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [5, 5], "use_bias": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_3"}, "class_name": "Activation"}, {"config": {"data_format": "channels_last", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1], "padding": "valid", "filters": 32, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_4", "trainable": true, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "use_bias": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_4"}, "class_name": "Activation"}, {"config": {"data_format": "channels_last", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1], "padding": "valid", "filters": 32, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_5", "trainable": true, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "use_bias": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_5"}, "class_name": "Activation"}, {"config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "name": "dense_1", "trainable": true, "units": 1164, "use_bias": true}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_6"}, "class_name": "Activation"}, {"config": {"activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "name": "dense_2", "trainable": true, "units": 100, "use_bias": true}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_7"}, "class_name": "Activation"}, {"config": {"activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "name": "dense_3", "trainable": true, "units": 50, "use_bias": true}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_8"}, "class_name": "Activation"}, {"config": {"activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "name": "dense_4", "trainable": true, "units": 10, "use_bias": true}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_9"}, "class_name": "Activation"}, {"config": {"activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "name": "dense_5", "trainable": true, "units": 1, "use_bias": true}, "class_name": "Dense"}], "name": "sequential_1"}, "class_name": "Sequential"}